Autodesk.Revit.DB.Structure.Rebar.ConstraintsCanBeEdited
Returns true, if the Rebar element's external constraints are available for editing using the
RebarConstraintsManager class.  Examples of where this method would return false are:
Rebar in Groups (which do not have constraints), or legacy, sketch-based Rebar elements
created before the introduction of RebarShape families in version 2009.
Since:
2014

Autodesk.Revit.DB.Structure.Rebar.ScaleToBoxFor3D(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,System.Double)
Move and resize a spiral or multiplanar instance to fit within a specified box.
The arguments are interpreted as an arbitrary rectangle in 3D with
vertices: origin, origin+xVec, origin+xVec+yVec, origin+yVec. One end of the
rebar shape is inscribed in this rectangle following the procedure described
for the ScaleToBox method. The other end is placed in the parallel plane at
distance (center-to-center) given by the height argument, in the
direction of (xVec x yVec).
Note that spiral shapes interpret the input arguments using a different convention
than multiplanar shapes.  For spiral shapes, the spiral start will be placed in
the rectangle defined by origin, xVec, yVec, and the end of the spiral will be
placed in the parallel plane.  For multiplanar shapes, the rebar is placed with
its primary shape definition located in the parallel plane defined by the height
argument, and its connector segments extending in the direction opposite (xVec x yVec).
This method replaces ScaleToBoxForSpiral() from prior releases.
origin:
One corner of the rectangle.
xVec:
Vector representing the first edge of the rectangle. The length
must be positive.
yVec:
Vector representing the second edge of the rectangle. Must
be perpendicular to xVec.
height:
New value for the Height or MultiplanarDepth property.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
xVec has zero length.
-or-
yVec has zero length.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This Rebar is not an instance of a spiral or multiplanar shape.
-or-
The operation has failed for geometric reasons, such as the box being too small
given the bar diameter.
Since:
2012

Autodesk.Revit.DB.Structure.Rebar.ScaleToBox(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Move and resize the bar to fit within a specified box.
The arguments are interpreted as an arbitrary
rectangle in 3D with vertices: origin, origin+xVec,
origin+xVec+yVec, origin+yVec. The algorithm then
proceeds as follows. First the bar is given the
default values of the shape parameters from the shape
definition. Then, if it is possible to do so without
violating the shape definition, the parameter values
are scaled so that the width and height of the shape
(including bar thickness) match the lengths of xVec and yVec.
If there is no way to do this within the shape definition
due to overconstraining, a compromise is attempted, such as
scaling the whole shape until either the width or the
height is correct. Finally the shape is rotated to
match the coordinate system of the box. The algorithm
is the same one used in one-click placement.
origin:
One corner of the rectangle.
xVec:
Vector representing the first edge of the rectangle. The length
must be positive.
yVec:
Vector representing the second edge of the rectangle. Must
be perpendicular to xVec.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
xVec has zero length.
-or-
yVec has zero length.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
This Rebar is an instance of a spiral or multiplanar shape.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The operation has failed for geometric reasons, such as the box being too small
given the bar diameter.
Since:
2009

Autodesk.Revit.DB.Structure.Rebar.SetLayoutAsMinimumClearSpacing(System.Double,System.Double,System.Boolean,System.Boolean,System.Boolean)
Sets the Layout Rule property of rebar set to MinimumClearSpacing
Remarks:
When changing the layout rule to MinimumClearSpacing, you must also simultaneously set Spacing,
SetLength, BarsOnNormalSide, IncludeFirstBar, and IncludeLastBar properties.
spacing:
The maximum spacing between rebar in rebar set
arrayLength:
The distribution length of rebar set
barsOnNormalSide:
Identifies if the bars of the rebar set are on the same side of the rebar plane indicated by the normal
includeFirstBar:
Identifies if the first bar in rebar set is shown
includeLastBar:
Identifies if the last bar in rebar set is shown
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The spacing isn't bigger than 0.0.
-or-
the set length arrayLength isn't acceptable.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
This Rebar is an instance of a spiral or multiplanar shape.
Since:
2009

Autodesk.Revit.DB.Structure.Rebar.SetLayoutAsNumberWithSpacing(System.Int32,System.Double,System.Boolean,System.Boolean,System.Boolean)
Sets the Layout Rule property of rebar set to NumberWithSpacing
Remarks:
When changing the layout rule to NumberWithSpacing, you must also simultaneously set NumberOfBarPositions,
Spacing, BarsOnNormalSide, IncludeFirstBar, and IncludeLastBar properties.
numberOfBarPositions:
The number of bar positions in rebar set
spacing:
The maximum spacing between rebar in rebar set
barsOnNormalSide:
Identifies if the bars of the rebar set are on the same side of the rebar plane indicated by the normal
includeFirstBar:
Identifies if the first bar in rebar set is shown
includeLastBar:
Identifies if the last bar in rebar set is shown
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
the number of bar positions numberOfBarPositions is less than 1 or more than 1002.
-or-
The spacing isn't bigger than 0.0.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
This Rebar is an instance of a spiral or multiplanar shape.
Since:
2009

Autodesk.Revit.DB.Structure.Rebar.SetLayoutAsMaximumSpacing(System.Double,System.Double,System.Boolean,System.Boolean,System.Boolean)
Sets the Layout Rule property of rebar set to MaximumSpacing
Remarks:
When changing the layout rule to MaximumSpacing, you must also simultaneously set Spacing,
SetLength, BarsOnNormalSide, IncludeFirstBar, and IncludeLastBar properties.
spacing:
The maximum spacing between rebar in rebar set
arrayLength:
The distribution length of rebar set
barsOnNormalSide:
Identifies if the bars of the rebar set are on the same side of the rebar plane indicated by the normal
includeFirstBar:
Identifies if the first bar in rebar set is shown
includeLastBar:
Identifies if the last bar in rebar set is shown
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The spacing isn't bigger than 0.0.
-or-
the set length arrayLength isn't acceptable.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
This Rebar is an instance of a spiral or multiplanar shape.
Since:
2009

Autodesk.Revit.DB.Structure.Rebar.SetLayoutAsFixedNumber(System.Int32,System.Double,System.Boolean,System.Boolean,System.Boolean)
Sets the Layout Rule property of rebar set to FixedNumber.
Remarks:
When changing the layout rule to FixedNumber, you must also simultaneously set NumberOfBarPositions,
SetLength, BarsOnNormalSide, IncludeFirstBar, and IncludeLastBar properties.
numberOfBarPositions:
The number of bar positions in rebar set
arrayLength:
The distribution length of rebar set
barsOnNormalSide:
Identifies if the bars of the rebar set are on the same side of the rebar plane indicated by the normal
includeFirstBar:
Identifies if the first bar in rebar set is shown
includeLastBar:
Identifies if the last bar in rebar set is shown
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
the number of bar positions numberOfBarPositions is less than 1 or more than 1002.
-or-
the set length arrayLength isn't acceptable.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
This Rebar is an instance of a spiral or multiplanar shape.
Since:
2009

Autodesk.Revit.DB.Structure.Rebar.SetLayoutAsSingle
Sets the Layout Rule property of rebar set to Single.
Remarks:
Only one bar will remain, which is at the position of rebar plane
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2009

Autodesk.Revit.DB.Structure.Rebar.ComputeDrivingCurves
Compute the driving curves.
Remarks:
The driving curves are the ones that appear in rebar sketch
mode. They include lines and arcs that drive the shape, but
exclude fillets and hooks. They always lie in a plane--
if the bar is 3D, these curves are a subset or a projection.
They are also used for shape matching.
Returns:
Returns an empty array if an error is encountered.
Since:
2014

Autodesk.Revit.DB.Structure.Rebar.GetBarPositionTransform(System.Int32)
Return a transform representing the relative position of any
individual bar in the set.
Remarks:
The transform is a translation along the distribution path.
It can be applied to the results of GetCenterlineCurves() to
produce any bar in the rebar set. For barPositionIndex=0,
the identity transform is always returned.
barPositionIndex:
An index between 0 and (NumberOfBarPositions-1).
Returns:
The position of a bar in the set relative to the first position.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barPositionIndex is not in the range [ 0, NumberOfBarPositions-1 ].
Since:
2013

Autodesk.Revit.DB.Structure.Rebar.GetDistributionPath
The distribution path of a rebar set.
Returns:
A line beginning at (0, 0, 0) and representing the direction and
length of the set.
Since:
2013

Autodesk.Revit.DB.Structure.Rebar.GetCenterlineCurves(System.Boolean,System.Boolean,System.Boolean,Autodesk.Revit.DB.Structure.MultiplanarOption)
A chain of curves representing the centerline of the rebar.
Remarks:
If the Rebar is a set, meaning GetLayoutRule() does not return Single,
this method returns the first rebar in the set, even if the
first bar is suppressed by IncludeFirstBar being false.
adjustForSelfIntersection:
If the curves overlap, as in a planar stirrup, this parameter controls
whether they should be adjusted to avoid intersection (as in fine views),
or kept in a single plane for simplicity (as in coarse views).
suppressHooks:
Identifies if the chain will include hooks curves.
suppressBendRadius:
Identifies if the connected chain will include unfilleted curves.
multiplanarOption:
If the Rebar is a multi-planar shape, this parameter controls whether to generate only
the curves in the primary plane (IncludeOnlyPlanarCurves), or to generate all curves,
(IncludeAllMultiplanarCurves) including the out-of-plane connector segments as well as
multi-planar copies of the primary plane curves.
This argument is ignored for planar shapes.
Returns:
The centerline curves or empty array if the curves cannot be computed because
the parameters values are inconsistent
with the constraints of the RebarShape definition.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2013.1

Autodesk.Revit.DB.Structure.Rebar.GetCenterlineCurves(System.Boolean,System.Boolean,System.Boolean)
A chain of curves representing the centerline of the rebar.
Remarks:
If the Rebar is a set, meaning GetLayoutRule() does not return Single,
this method returns the first rebar in the set, even if the
first bar is suppressed by IncludeFirstBar being false.
adjustForSelfIntersection:
If the curves overlap, as in a planar stirrup, this parameter controls
whether they should be adjusted to avoid intersection (as in fine views),
or kept in a single plane for simplicity (as in coarse views).
suppressHooks:
Identifies if the chain will include hooks curves.
suppressBendRadius:
Identifies if the connected chain will include unfilleted curves.
Returns:
The centerline curves or empty array if the curves cannot be computed because
the parameters values are inconsistent
with the constraints of the RebarShape definition.
Since:
2013

Autodesk.Revit.DB.Structure.Rebar.CreateFromCurvesAndShape(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Structure.RebarShape,Autodesk.Revit.DB.Structure.RebarBarType,Autodesk.Revit.DB.Structure.RebarHookType,Autodesk.Revit.DB.Structure.RebarHookType,Autodesk.Revit.DB.Element,Autodesk.Revit.DB.XYZ,System.Collections.Generic.IList{Autodesk.Revit.DB.Curve},Autodesk.Revit.DB.Structure.RebarHookOrientation,Autodesk.Revit.DB.Structure.RebarHookOrientation)
Creates a new instance of a Rebar element within the project.
The instance will have the default shape parameters from the RebarShape.
If the RebarShapeDefinesHooks flag in ReinforcementSettings has been set to true,
then both the curves and hooks must match the RebarShape definition.
Otherwise, the hooks can be different than the defaults specified in the RebarShape
doc:
A document.
rebarShape:
A RebarShape element that defines the shape of the rebar.
A RebarShape element matches curves and hooks.
A RebarShape element provides RebarStyle of the rebar.
barType:
A RebarBarType element that defines bar diameter, bend radius and material of the rebar.
startHook:
A RebarHookType element that defines the hook for the start of the bar.
If this parameter is null, it means to create a rebar with no hook.
endHook:
A RebarHookType element that defines the hook for the end of the bar.
If this parameter is null, it means to create a rebar with no hook.
host:
The element to which the rebar belongs. The element must support rebar hosting;
see Autodesk.Revit.DB.Structure.RebarHostData.
norm:
The normal to the plane that the rebar curves lie on.
curves:
An array of curves that define the shape of the rebar curves.
They must belong to the plane defined by the normal and origin.
Bends and hooks should not be included in the array of curves.
startHookOrient:
Defines the orientation of the hook plane at the start of the rebar with respect to the orientation of the first curve and the plane normal.
Only two values are permitted:
Value = Right: The hook is on your right as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
Value = Left: The hook is on your left as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
endHookOrient:
Defines the orientation of the hook plane at the end of the rebar with respect to the orientation of the last curve and the plane normal.
Only two values are permitted:
Value = Right: The hook is on your right as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
Value = Left: The hook is on your left as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
Returns:
The newly created Rebar instance, or null if the operation fails.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element host was not found in the given document.
-or-
host is not a valid rebar host.
-or-
The input curves is empty.
-or-
The input curves contains at least one curve which is not a bound Line or bound Arc
and is not supported for this operation.
-or-
curves do not form a valid CurveLoop.
-or-
The input curves contains at least one helical curve and is not supported for this operation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
norm has zero length.
-or-
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
curves contains non-fillet arcs with radii that are less than the
minimum bend radius for the RebarBarType and RebarShape style.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
rebarShape does not match curves.
Since:
2013

Autodesk.Revit.DB.Structure.Rebar.CreateFromRebarShape(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Structure.RebarShape,Autodesk.Revit.DB.Structure.RebarBarType,Autodesk.Revit.DB.Element,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Creates a new Rebar, as an instance of a RebarShape.
The instance will have the default shape parameters from the RebarShape,
and its location is based on the bounding box of the shape in the shape definition.
Hooks are removed from the shape before computing its bounding box.
If appropriate hooks can be found in the document, they will be assigned arbitrarily.
doc:
A document.
rebarShape:
A RebarShape element that defines the shape of the rebar.
barType:
A RebarBarType element that defines bar diameter, bend radius and material of the rebar.
host:
The element to which the rebar belongs. The element must support rebar hosting;
see Autodesk.Revit.DB.Structure.RebarHostData.
origin:
The lower-left corner of the shape's bounding box will be placed at this point in the project.
xVec:
The x-axis in the shape definition will be mapped to this direction in the project.
yVec:
The y-axis in the shape definition will be mapped to this direction in the project.
Returns:
The newly created Rebar instance, or null if the operation fails.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element host was not found in the given document.
-or-
host is not a valid rebar host.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
xVec has zero length.
-or-
yVec has zero length.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2009

Autodesk.Revit.DB.Structure.Rebar.CreateFromCurves(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Structure.RebarStyle,Autodesk.Revit.DB.Structure.RebarBarType,Autodesk.Revit.DB.Structure.RebarHookType,Autodesk.Revit.DB.Structure.RebarHookType,Autodesk.Revit.DB.Element,Autodesk.Revit.DB.XYZ,System.Collections.Generic.IList{Autodesk.Revit.DB.Curve},Autodesk.Revit.DB.Structure.RebarHookOrientation,Autodesk.Revit.DB.Structure.RebarHookOrientation,System.Boolean,System.Boolean)
Creates a new instance of a Rebar element within the project.
doc:
A document.
style:
The usage of the bar, "standard" or "stirrup/tie".
barType:
A RebarBarType element that defines bar diameter, bend radius and material of the rebar.
startHook:
A RebarHookType element that defines the hook for the start of the bar.
If this parameter is null, it means to create a rebar with no hook.
endHook:
A RebarHookType element that defines the hook for the end of the bar.
If this parameter is null, it means to create a rebar with no hook.
host:
The element to which the rebar belongs. The element must support rebar hosting;
see Autodesk.Revit.DB.Structure.RebarHostData.
norm:
The normal to the plane that the rebar curves lie on.
curves:
An array of curves that define the shape of the rebar curves.
They must belong to the plane defined by the normal and origin.
Bends and hooks should not be included in the array of curves.
startHookOrient:
Defines the orientation of the hook plane at the start of the rebar with respect to the orientation of the first curve and the plane normal.
Only two values are permitted:
Value = Right: The hook is on your right as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
Value = Left: The hook is on your left as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
endHookOrient:
Defines the orientation of the hook plane at the end of the rebar with respect to the orientation of the last curve and the plane normal.
Only two values are permitted:
Value = Right: The hook is on your right as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
Value = Left: The hook is on your left as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
useExistingShapeIfPossible:
Attempts to assign a RebarShape from those existing in the document. If no shape matches, NewRebar returns  or creates a new shape, according to the parameter createNewShape.
When both parameters are "true", the behavior is the same as sketching rebar in the UI. At least one of these parameters must be "true".
If the RebarShapeDefinesHooks flag in ReinforcementSettings has been set to false, and a RebarShape cannot be found with both matching curves and hooks,
then this method will perform a second search, ignoring hook information.
createNewShape:
Creates a shape in the document to match the curves, hooks, and style specified, and assigns it to the new rebar instance.
Shape creation will not succeed unless one or more other shapes already exist in the document, and these shapes
have enough shape parameters to define a shape for these curves.
Returns:
The newly created Rebar instance, or null if the operation fails.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element host was not found in the given document.
-or-
host is not a valid rebar host.
-or-
The input curves is empty.
-or-
The input curves contains at least one curve which is not a bound Line or bound Arc
and is not supported for this operation.
-or-
curves do not form a valid CurveLoop.
-or-
The input curves contains at least one helical curve and is not supported for this operation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
norm has zero length.
-or-
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
Both useExistingShapeIfPossible and createNewShape are false.
-or-
curves contains non-fillet arcs with radii that are less than the
minimum bend radius for the RebarBarType and bar style.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2009

Autodesk.Revit.DB.Structure.Rebar.RebarShapeId
The RebarShape element that defines the shape of the rebar.
Remarks:
Changing the value of this property causes the Rebar instance to choose values for its
shape parameters to preserve its previous shape as closely as possible
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: shapeId is not the id of a RebarShape in the document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Since:
2013

Autodesk.Revit.DB.Structure.Rebar.MultiplanarDepth
For a multiplanar rebar, the depth of the instance.
Remarks:
Applicable only when an instance of a RebarShape with
a RebarShapeMultiplanarDefinition.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: multiplanarDepth must be positive.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This Rebar is not an instance of a multiplanar shape.
Since:
2009

Autodesk.Revit.DB.Structure.Rebar.Pitch
For a spiral, the pitch, or vertical distance traveled in one rotation.
Remarks:
Applies only to instances where RebarShape.Definition is of type
RebarShapeDefinitionByArc, and its Type property is equal to the value
RebarShapeDefinitionByArcType.Spiral.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: pitch must be positive.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This Rebar is not an instance of a spiral shape.
Since:
2009

Autodesk.Revit.DB.Structure.Rebar.TopFinishingTurns
For a spiral, the number of finishing turns at the upper end of the spiral.
Remarks:
Applies only to instances where RebarShape.Definition is of type
RebarShapeDefinitionByArc, and its Type property is equal to the value
RebarShapeDefinitionByArcType.Spiral.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: turns must be between 0 and 100.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This Rebar is not an instance of a spiral shape.
Since:
2009

Autodesk.Revit.DB.Structure.Rebar.BaseFinishingTurns
For a spiral, the number of finishing turns at the lower end of the spiral.
Remarks:
Applies only to instances where RebarShape.Definition is of type
RebarShapeDefinitionByArc, and its Type property is equal to the value
RebarShapeDefinitionByArcType.Spiral.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: turns must be between 0 and 100.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This Rebar is not an instance of a spiral shape.
Since:
2009

Autodesk.Revit.DB.Structure.Rebar.Height
For a spiral, the overall height.
Remarks:
Applies only to instances where RebarShape.Definition is of type
RebarShapeDefinitionByArc, and its Type property is equal to the value
RebarShapeDefinitionByArcType.Spiral.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: height must be positive.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This Rebar is not an instance of a spiral shape.
Since:
2009

Autodesk.Revit.DB.Structure.Rebar.ArrayLength
Identifies the distribution path length of rebar set.
The distribution path length of rebar set.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: the set length arrayLength isn't acceptable.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
This rebar element represents a single bar (the layout rule is Single).
Since:
2009

Autodesk.Revit.DB.Structure.Rebar.BarsOnNormalSide
Identifies if the bars of the rebar set are on the same side of the rebar plane indicated by the normal.
True if the bars of rebar set are on the same side of the rebar plane indicated by the normal,
and false if the bars are on the opposite side.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
This rebar element represents a single bar (the layout rule is Single).
Since:
2009

Autodesk.Revit.DB.Structure.Rebar.Normal
A unit-length vector normal to the plane of the rebar
Since:
2009